# BuiltInFailures.SplitSketchBasedElementFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplitSketchBasedElementFailures Class
BuiltInFailures Class Members See Also
---
Failures related to the split sketched based element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class SplitSketchBasedElementFailures
```

Visual Basic
---
```text
Public NotInheritable Class SplitSketchBasedElementFailures
```

Visual C++
---
```text
public ref class SplitSketchBasedElementFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..SplitSketchBasedElementFailures
# See Also
BuiltInFailures..::..SplitSketchBasedElementFailures Members
Autodesk.Revit.DB Namespace